org/blog.org
#+title: ORG Content
#+author: Victor Dorneanu
#+startup: indent fold
#+hugo_base_dir: ../
#+hugo_section: posts
#+hugo_auto_set_lastmod: t
#+hugo_paired_shortcodes: %sidenote
#+property: header-args :eval never-export

#+macro: zk [[https://brainfck.org/#$1][$2]]
#+macro: bib [[https://brainfck.org/bib.html#$1][$2]]
#+macro: relref @@hugo:[@@ $1 @@hugo:]({{< relref "$2" >}})@@
#+macro: titleref @@hugo:{{< titleref "$1" "@@ $2 @@hugo:" >}}@@


** DONE My 2021 review                                                         :review:books:tools:productivity:
CLOSED: [2021-12-13 ]
:PROPERTIES:
:EXPORT_FILE_NAME: 2021-my-2021-review
:END:
After last year's pandemic shock, this year has brought more hope and motivation to
people. I've felt motivated to learn new things, deep-dive into unknown areas and finally
change some things in my life. In this post I'll share with you my most valued (software)
tools, productivity tips, some books worth reading and finally some failure and success
with regards to my habits.
*** Health
**** Wim Hof Method
Last year just before the (pandemic) winter blues was about to begin I've had enough of
that feeling something you cannot control was already part of my daily life. Seeking for
more *self-control* and that "I'm still alive" feeling, I've decided to go for [[https://www.wimhofmethod.com/][The Wim Hof
Method]].

I was determined to cold shower every day and do breath work as well. Breathing exercises
were not new to me since I was practising {{{zk(Pranayama,Pranayama)}}} for a while.

After some weeks of practice cold was not an enemy anymore. My body (and also my mind)
adapted to that kind of stress and soon I was able to go out without any jacket, just
wearing a t-shirt - and my trouses of course :) Eventually I was able to keep my habbits
and around February I was "bathing" in snow in my swim shorts. Besides that, during my
breath work sessions I managed to hold my breath for more 3 minutes - several times. All
this success motivated me to keep going and make my new habbits part of my {{{zk(Atomic
Habits/4 Laws of Behaviour Change,life style)}}}.

# {{< gbox src="https://img.youtube.com/vi/0BNejY1e9ik/0.jpg" target="[[https://www.youtube.com/watch?v=0BNejY1e9ik]]" title="The Wim Hof Method" caption="Breath work with Wim Hof" pos="right" >}}
#+html: {{< youtube 0BNejY1e9ik >}}

*** Books
As you know you can always browse [[https://brainfck.org/#Books][my digital bookshelf]] in my [[https://brainfck.org/][personal Zettelkasten]]. This
year I've read more IT related books than last year. I've especially focussed on
{{{zk(Software Architecture,Software Architecture)}}}, {{{zk(Golang,Golang)}}} and
{{{zk(DevSecOps,DevSecOps)}}}.
**** Clean Architecture                                                      :architecture:
If you write code and don't know [[http://cleancoder.com/products][Uncle Bob]] then you'll have to read this book. Since my
background is not of software engineering I had to learn a lot about good coding
principles and how to structure my code properly. Very early in this process I came across
Uncle Bob's famous [[https://blog.cleancoder.com/uncle-bob/2012/08/13/the-clean-architecture.html][Clean Architecture]] diagram which describes how to structure your
software project into different /layers/.

Well then I was blindly using those principles in my software projects without knowing
that /Clean Architecture/ is more than a diagram and some depedencies between some layers.
I'm glad I've finally managed to read this book (along with {{{zk(The Clean Code,The Clean
Code)}}} and {{{zk(The Clean Coder,The Clean Coder)}}} which were not that good as this
one) and learn more about {{{zk(Software Engineering,engineering principles)}}} and
{{{zk(Software Architecture,software architecture)}}} in general. Additionally I think
{{{zk(SOLID,SOLID principles)}}} should be part of every (software) engineer's skills
repertoire.

#+begin_quote
You think good architecture is expensive, try bad architecture. -- {{{zk(The Clean
Architecture - Note 2,The Clean Architecture - Note 2)}}}
#+end_quote

I was also surprised that {{{zk(Hexagonal Architecture,Hexagonal Architecture)}}} (also
known as *ports* and *adapters* architecture) almost has the same principles.

{{< notice info >}}
I also recommend [[https://herbertograca.com/2017/11/16/explicit-architecture-01-ddd-hexagonal-onion-clean-cqrs-how-i-put-it-all-together/][DDD, Hexagonal, Onion, Clean, CQRS ... How I put it all together]] reading.
An excellent article!
{{< /notice >}}
**** Black Hat Go                                                            :golang:
Back at [[/2021/09/15/bye-bye-scout24/][Scout24]] we were mainly using Python for our internal services and tools. But I
wanted to make my colleagues more aware of Golang's capabilities and introduce this
language to the team. Instead of some standardized approach (core types, basic control
flows, "classes", interfaces etc.) I wanted to actually *do* something with the language
that might catch people's interest.

[[https://www.goodreads.com/book/show/35642241-black-hat-go][Black Hat Go]] was the right book to start with. It gives you just enough details to get you
started with the language and then you start implementing network scanners, [[https://gist.github.com/dorneanu/02c9c5bb83e881e7ad2c1e93c7c2fd24][keyboard
loggers]], DNS tunneling tools (like [[https://github.com/sysdream/chashell][chashell]]) and much more. I used some of the examples in
the book to introduce my team to /offensive/ hacking while showing Golang's key features (go
routines, interfaces, composition instead of inheritance etc.) Also if you're a pentester
and need to cross-compile your tools for different architectures, this book is definitely
for you.

**** Accelerate
About the science of Lean software and DevOps. I wrote an extensive [[/2021/11/24/book-review-accelerate-the-science-of-lean-software-and-devops/][summary in my last blog post]].
**** Agile Application Security                                              :appsec:
I consider this book to be the best one I've read on {{{zk(AppSec,Application Security)}}}
in the last years. And I'll tell you why: When was the last time that a cool *defensive*
mechanism/measure/technology (beside the cyber-security branded vendor X products) had a
cool name like Logjam, Shellshock or Heartbleed? I know vulnerability research, exploit
development and some cool hacks are fun. But this is not what's needed to build a Security
minded culture inside some organization. This is also not what developers (and everybody
else included in the software engineering process) need to know. In an Agile world
different roles have to work together: Developers need to understand and adopt Security
best practices and also take responsability for the security of their systems. You build
it, you run it and you also keep it safe and secure!

Product owners/managers need to understand security/compliance requirements and give agile
teams enough time for the implementation of the security measures. And last but not least:
Security professionals will also have to adapt to the Agile world. They need to learn to
accept changes more often, to work faster and manage Security risks in incremental terms.
And most important: Security needs to become an *enabler* and not a blocker!
