content/posts/2021-my-2021-review.md
+++
title = "My 2021 review"
author = ["Victor Dorneanu"]
date = 2021-12-13T00:00:00+01:00
lastmod = 2022-01-10T13:59:29+01:00
tags = ["review", "books", "tools", "productivity"]
draft = false
+++

After last year's pandemic shock, this year has brought more hope and motivation to
people. I've felt motivated to learn new things, deep-dive into unknown areas and finally
change some things in my life. In this post I'll share with you my most valued (software)
tools, productivity tips, some books worth reading and finally some failure and success
with regards to my habits.


## Health {#health}


### Wim Hof Method {#wim-hof-method}

Last year just before the (pandemic) winter blues was about to begin I've had enough of
that feeling something you cannot control was already part of my daily life. Seeking for
more **self-control** and that "I'm still alive" feeling, I've decided to go for [The Wim Hof
Method](https://www.wimhofmethod.com/).

I was determined to cold shower every day and do breath work as well. Breathing exercises
were not new to me since I was practising [Pranayama](https://brainfck.org/#Pranayama) for a while.

After some weeks of practice cold was not an enemy anymore. My body (and also my mind)
adapted to that kind of stress and soon I was able to go out without any jacket, just
wearing a t-shirt - and my trouses of course :) Eventually I was able to keep my habbits
and around February I was "bathing" in snow in my swim shorts. Besides that, during my
breath work sessions I managed to hold my breath for more 3 minutes - several times. All
this success motivated me to keep going and make my new habbits part of my [life style](https://brainfck.org/#Atomic%20Habits/4%20Laws%20of%20Behaviour%20Change).

{{< youtube 0BNejY1e9ik >}}


## Books {#books}

As you know you can always browse [my digital bookshelf](https://brainfck.org/#Books) in my [personal Zettelkasten](https://brainfck.org/). This
year I've read more IT related books than last year. I've especially focussed on
[Software Architecture](https://brainfck.org/#Software%20Architecture), [Golang](https://brainfck.org/#Golang) and
[DevSecOps](https://brainfck.org/#DevSecOps).


### Clean Architecture {#clean-architecture}

If you write code and don't know [Uncle Bob](http://cleancoder.com/products) then you'll have to read this book. Since my
background is not of software engineering I had to learn a lot about good coding
principles and how to structure my code properly. Very early in this process I came across
Uncle Bob's famous [Clean Architecture](https://blog.cleancoder.com/uncle-bob/2012/08/13/the-clean-architecture.html) diagram which describes how to structure your
software project into different _layers_.

Well then I was blindly using those principles in my software projects without knowing
that _Clean Architecture_ is more than a diagram and some depedencies between some layers.
I'm glad I've finally managed to read this book (along with [The Clean Code](https://brainfck.org/#The%20Clean%20Code) and [The Clean Coder](https://brainfck.org/#The%20Clean%20Coder) which were not that good as this
one) and learn more about [engineering principles](https://brainfck.org/#Software%20Engineering) and
[software architecture](https://brainfck.org/#Software%20Architecture) in general. Additionally I think
[SOLID principles](https://brainfck.org/#SOLID) should be part of every (software) engineer's skills
repertoire.

> You think good architecture is expensive, try bad architecture. -- [The Clean Architecture - Note 2](https://brainfck.org/#The%20Clean%20Architecture%20-%20Note%202)

I was also surprised that [Hexagonal Architecture](https://brainfck.org/#Hexagonal%20Architecture) (also
known as **ports** and **adapters** architecture) almost has the same principles.

{{< notice info >}}
I also recommend [DDD, Hexagonal, Onion, Clean, CQRS ... How I put it all together](https://herbertograca.com/2017/11/16/explicit-architecture-01-ddd-hexagonal-onion-clean-cqrs-how-i-put-it-all-together/) reading.
An excellent article!
{{< /notice >}}


### Black Hat Go {#black-hat-go}

Back at [Scout24](/2021/09/15/bye-bye-scout24/) we were mainly using Python for our internal services and tools. But I
wanted to make my colleagues more aware of Golang's capabilities and introduce this
language to the team. Instead of some standardized approach (core types, basic control
flows, "classes", interfaces etc.) I wanted to actually **do** something with the language
that might catch people's interest.

[Black Hat Go](https://www.goodreads.com/book/show/35642241-black-hat-go) was the right book to start with. It gives you just enough details to get you
started with the language and then you start implementing network scanners, [keyboard
loggers](https://gist.github.com/dorneanu/02c9c5bb83e881e7ad2c1e93c7c2fd24), DNS tunneling tools (like [chashell](https://github.com/sysdream/chashell)) and much more. I used some of the examples in
the book to introduce my team to _offensive_ hacking while showing Golang's key features (go
routines, interfaces, composition instead of inheritance etc.) Also if you're a pentester
and need to cross-compile your tools for different architectures, this book is definitely
for you.


### Accelerate {#accelerate}

About the science of Lean software and DevOps. I wrote an extensive [summary in my last blog post](/2021/11/24/book-review-accelerate-the-science-of-lean-software-and-devops/).


### Agile Application Security {#agile-application-security}

I consider this book to be the best one I've read on [Application Security](https://brainfck.org/#AppSec)
in the last years. And I'll tell you why: When was the last time that a cool **defensive**
mechanism/measure/technology (beside the cyber-security branded vendor X products) had a
cool name like Logjam, Shellshock or Heartbleed? I know vulnerability research, exploit
development and some cool hacks are fun. But this is not what's needed to build a Security
minded culture inside some organization. This is also not what developers (and everybody
else included in the software engineering process) need to know. In an Agile world
different roles have to work together: Developers need to understand and adopt Security
best practices and also take responsability for the security of their systems. You build
it, you run it and you also keep it safe and secure!

Product owners/managers need to understand security/compliance requirements and give agile
teams enough time for the implementation of the security measures. And last but not least:
Security professionals will also have to adapt to the Agile world. They need to learn to
accept changes more often, to work faster and manage Security risks in incremental terms.
And most important: Security needs to become an **enabler** and not a blocker!
