org/blog.org
**** Go with the Domain                                                      :ddd:
If you know about [[https://threedots.tech][Three Dots Labs]] already and also have read their blog series on
[[https://threedots.tech/tags/ddd/][Domain-driven Design with Go]] then you don't necessarily need to read [[https://threedots.tech/go-with-the-domain][this book]]. I think
the content is quite good and has to be "diggested" over a longer period of time. However,
if you're not familiar with {{{zk(DDD,Domain-Driven Design)}}} principles this book might
be to much for you. Also be prepared to invest a lot of time in their [[https://github.com/ThreeDotsLabs/wild-workouts-go-ddd-example][Go DDD example
application]] and carefully read the code. After reading their blog posts first I was
expecting to mind more context/background information in their book. This was not the case
and I also don't blame them for this. Writing a book (and also blog posts) is very time
intensive especially when you don't have that much time available.
**** 1984
I remember when I first started reading the first 20 pages and I was shocked how much of
our today's world was part of the environment described. Also this book got recommended to
me several ways but it was until the pandemic that I had enough motivation to push myself
through. I'm not a Sci-Fi fan and usually you won't find this kind of book genre in my
{{{zk(Books,bookshelf)}}}. But I'll add this one to the "must reads". Eventually I'll read
it again in some couple of years just to find out what happened since last time I did so.
I guess there is a reason this book belongs to the [[https://en.wikipedia.org/wiki/List_of_best-selling_books][best selling ones]] and I definitelly
recommend it to everyone interested in /politics/, /history/ and of course /Sci-Fi/.
**** Das Experiment sind wir
In English: "We are the experiment". Despite its rather controversial title, I read this
book at the beginning of the year after listening to this podcast: [[https://www.kuechenstud.io/medienradio/podcast/di091-fluch-und-segen-exponentiellen-wachstums-christian-stoecker-autor/][Das Interview: Fluch
und Segen exponentiellen Wachstums]] (in English: Curse and blessing of exponential growth).
This book got me into the basics of {{{zk(CRISPR/Cas9,CRISPR/Cas9)}}} and
{{{zk(mRNA,mRNA)}}}. It also made me think about schooling and education systems which (at
least in Germany) don't really teach students about complex systems/mechanisms that
surround us. And to be more specific: AI/ML basics are not taught at school, benefits of
CRISPR gene editing are often ignored by mass-media. Instead people have this feeling
they're part of something that /happens/ to them instead of /being/ part of that something.
You could apply this to {{{zk(Corona,Corona)}}} and many other global challenges (climate
change?) that will follow in the next years.
**** Factfulnes
I remember someone said to me I should read this book because [[https://www.gatesnotes.com/books/factfulness][Bill Gates recommended it]].
And it turned out this book changed the way how I see the world. But most important: It
showed me that my knowledge about the world is kind of out-dated. Just to give you an
example: Before reading the book I thought the world was divided into 3 parts/classes. We
tend to classify countries around the globe in /developed/ economies, economies /in
transition/ and /developing/ economies. But if you look at the data - at this book is
definitelly /data-driven/ - you'll notice that you can divide the world on a /4/ category
model based on /income per person/ (check [[https://en.wikipedia.org/wiki/Factfulness:_Ten_Reasons_We%27re_Wrong_About_the_World_%E2%80%93_and_Why_Things_Are_Better_Than_You_Think][Four income levels]] at Wikipedia). And this is just
/one/ example. If you want to self-test your views/knowledge make sure you do this at
[[https://www.gapminder.org/][gapminder.org]] (they also have really awesome [[https://www.gapminder.org/tools/][visualizations]]).
**** The Plant Paradox
Initially I wasn't sure if I should write a summary on this one. And that's because this
one is the type of books you know it contains somehow false affirmations but the are some
that make you ponder. Since 2 years I constantly try to adjust my /Nutrition/ based on
information I get from different books. After reading {{{zk(How not to die,How not to
die)}}} last year I think I managed to get most of my nutritional biases under control. I
also managed to get a deeper understanding of the bio-mechanics that make our bodies so
interesting. Well /The Plant Paradox/ tries to turn scientific based nutritional knowledge
upside down. At the core of the "paradox" are [[https://en.wikipedia.org/wiki/Lectin][lectins]] that are mostly found in all foods,
especially legumes, fruits and grains. The author claims that these tiny proteins cause
/gut permeability/ and therefore /inflamations/ that drive auto-immune diseases. While Dr.
Gundry's thesis [[https://www.youtube.com/watch?v=7NT4q_5dfLs&ab_channel=NutritionFacts.org][seems to be wrong]] (and yes, I'm fan of Dr. Greger) and most of the lectins
can be removed by (pressurized) cooking, I still think there are some small grains of
truth in there. I also recommend reading [[https://hcfricke.com/2017/09/24/buchkritik-plant-paradox-von-stephen-r-gundry-md/][this summary]] (in German) which provides more
cross-doamin knowledge related to different aspects of the thesis.

*** Habits
Almost one year ago - and definitely after reading {{{zk(Atomic Habits,Atomic Habits)}}} -
I was looking for a digital habit tracking tool. My motivation was not to develop new
habits but stick to existing ones and have a visual dashboard how well I'm doing. After
giving up my {{{zk(Bullet Journal,Bullet Journal)}}} tracking page, I've finally found
[[https://play.google.com/store/apps/details?id=org.isoron.uhabits&hl=en&gl=US][Loop Habit Tracker]] which accompanies me every day.

{{< gbox src="/posts/img/2021/my-review/habits-app.png" title="Loop Habit Tracker Application" caption="Main view" pos="left" >}}

I use /widgets/ on my (Android) where I can easily toggle multiple habits as done with
simple clicks. The advantage of using widgets is the fact you don't have to first run the
application /and then/ toggle the habits. Usually after my morning routines, I just go
through my habits and click accordingly.

{{< gbox src="/posts/img/2021/my-review/habits-widgets.png" title="Loop Habit Tracker Application" caption="Widgets" pos="left"  >}}


In the following sections you'll see different /heat maps/ related to some /habit/. They show
you on which days a specific habit activity took place or not.
**** Meditation
{{< gbox src="/posts/img/2021/my-review/habits-meditation.png" title="Meditation" caption="Heat map 2021" pos="left"  >}}

I use [[https://www.7mind.de/][7mind]] for my morning meditation. Usually I don't track my meditation /time/ but from
times to times I do longer session (up to 20 minutes). As you can see I usually don't
meditate at the weekend since I rather spend time with my family and prefer not to wake up
that early.
**** Cold shower
{{< gbox src="/posts/img/2021/my-review/habits-cold-shower.png" title="Cold shower" caption="Heat map 2021" pos="left"  >}}

After reading more about [[https://www.wimhofmethod.com/][The Wim Hof Method]] I was determined enough to take cold showers
on a regular basis. I'm pretty happy I managed to stick to this habit throughout the year.
