content/posts/2021-my-2021-review.md


### Go with the Domain {#go-with-the-domain}

If you know about [Three Dots Labs](https://threedots.tech) already and also have read their blog series on
[Domain-driven Design with Go](https://threedots.tech/tags/ddd/) then you don't necessarily need to read [this book](https://threedots.tech/go-with-the-domain). I think
the content is quite good and has to be "diggested" over a longer period of time. However,
if you're not familiar with [Domain-Driven Design](https://brainfck.org/#DDD) principles this book might
be to much for you. Also be prepared to invest a lot of time in their [Go DDD example
application](https://github.com/ThreeDotsLabs/wild-workouts-go-ddd-example) and carefully read the code. After reading their blog posts first I was
expecting to mind more context/background information in their book. This was not the case
and I also don't blame them for this. Writing a book (and also blog posts) is very time
intensive especially when you don't have that much time available.


### 1984 {#1984}

I remember when I first started reading the first 20 pages and I was shocked how much of
our today's world was part of the environment described. Also this book got recommended to
me several ways but it was until the pandemic that I had enough motivation to push myself
through. I'm not a Sci-Fi fan and usually you won't find this kind of book genre in my
[bookshelf](https://brainfck.org/#Books). But I'll add this one to the "must reads". Eventually I'll read
it again in some couple of years just to find out what happened since last time I did so.
I guess there is a reason this book belongs to the [best selling ones](https://en.wikipedia.org/wiki/List%5Fof%5Fbest-selling%5Fbooks) and I definitelly
recommend it to everyone interested in _politics_, _history_ and of course _Sci-Fi_.


### Das Experiment sind wir {#das-experiment-sind-wir}

In English: "We are the experiment". Despite its rather controversial title, I read this
book at the beginning of the year after listening to this podcast: [Das Interview: Fluch
und Segen exponentiellen Wachstums](https://www.kuechenstud.io/medienradio/podcast/di091-fluch-und-segen-exponentiellen-wachstums-christian-stoecker-autor/) (in English: Curse and blessing of exponential growth).
This book got me into the basics of [CRISPR/Cas9](https://brainfck.org/#CRISPR/Cas9) and
[mRNA](https://brainfck.org/#mRNA). It also made me think about schooling and education systems which (at
least in Germany) don't really teach students about complex systems/mechanisms that
surround us. And to be more specific: AI/ML basics are not taught at school, benefits of
CRISPR gene editing are often ignored by mass-media. Instead people have this feeling
they're part of something that _happens_ to them instead of _being_ part of that something.
You could apply this to [Corona](https://brainfck.org/#Corona) and many other global challenges (climate
change?) that will follow in the next years.


### Factfulnes {#factfulnes}

I remember someone said to me I should read this book because [Bill Gates recommended it](https://www.gatesnotes.com/books/factfulness).
And it turned out this book changed the way how I see the world. But most important: It
showed me that my knowledge about the world is kind of out-dated. Just to give you an
example: Before reading the book I thought the world was divided into 3 parts/classes. We
tend to classify countries around the globe in _developed_ economies, economies _in
transition_ and _developing_ economies. But if you look at the data - at this book is
definitelly _data-driven_ - you'll notice that you can divide the world on a _4_ category
model based on _income per person_ (check [Four income levels](https://en.wikipedia.org/wiki/Factfulness:%5FTen%5FReasons%5FWe%27re%5FWrong%5FAbout%5Fthe%5FWorld%5F%E2%80%93%5Fand%5FWhy%5FThings%5FAre%5FBetter%5FThan%5FYou%5FThink) at Wikipedia). And this is just
_one_ example. If you want to self-test your views/knowledge make sure you do this at
[gapminder.org](https://www.gapminder.org/) (they also have really awesome [visualizations](https://www.gapminder.org/tools/)).


### The Plant Paradox {#the-plant-paradox}

Initially I wasn't sure if I should write a summary on this one. And that's because this
one is the type of books you know it contains somehow false affirmations but the are some
that make you ponder. Since 2 years I constantly try to adjust my _Nutrition_ based on
information I get from different books. After reading [How not to die](https://brainfck.org/#How%20not%20to%20die) last year I think I managed to get most of my nutritional biases under control. I
also managed to get a deeper understanding of the bio-mechanics that make our bodies so
interesting. Well _The Plant Paradox_ tries to turn scientific based nutritional knowledge
upside down. At the core of the "paradox" are [lectins](https://en.wikipedia.org/wiki/Lectin) that are mostly found in all foods,
especially legumes, fruits and grains. The author claims that these tiny proteins cause
_gut permeability_ and therefore _inflamations_ that drive auto-immune diseases. While Dr.
Gundry's thesis [seems to be wrong](https://www.youtube.com/watch?v=7NT4q%5F5dfLs&ab%5Fchannel=NutritionFacts.org) (and yes, I'm fan of Dr. Greger) and most of the lectins
can be removed by (pressurized) cooking, I still think there are some small grains of
truth in there. I also recommend reading [this summary](https://hcfricke.com/2017/09/24/buchkritik-plant-paradox-von-stephen-r-gundry-md/) (in German) which provides more
cross-doamin knowledge related to different aspects of the thesis.


## Habits {#habits}

Almost one year ago - and definitely after reading [Atomic Habits](https://brainfck.org/#Atomic%20Habits) -
I was looking for a digital habit tracking tool. My motivation was not to develop new
habits but stick to existing ones and have a visual dashboard how well I'm doing. After
giving up my [Bullet Journal](https://brainfck.org/#Bullet%20Journal) tracking page, I've finally found
[Loop Habit Tracker](https://play.google.com/store/apps/details?id=org.isoron.uhabits&hl=en&gl=US) which accompanies me every day.

{{< gbox src="/posts/img/2021/my-review/habits-app.png" title="Loop Habit Tracker Application" caption="Main view" pos="left" >}}

I use _widgets_ on my (Android) where I can easily toggle multiple habits as done with
simple clicks. The advantage of using widgets is the fact you don't have to first run the
application _and then_ toggle the habits. Usually after my morning routines, I just go
through my habits and click accordingly.

{{< gbox src="/posts/img/2021/my-review/habits-widgets.png" title="Loop Habit Tracker Application" caption="Widgets" pos="left"  >}}

In the following sections you'll see different _heat maps_ related to some _habit_. They show
you on which days a specific habit activity took place or not.


### Meditation {#meditation}

{{< gbox src="/posts/img/2021/my-review/habits-meditation.png" title="Meditation" caption="Heat map 2021" pos="left"  >}}

I use [7mind](https://www.7mind.de/) for my morning meditation. Usually I don't track my meditation _time_ but from
times to times I do longer session (up to 20 minutes). As you can see I usually don't
meditate at the weekend since I rather spend time with my family and prefer not to wake up
that early.


### Cold shower {#cold-shower}

{{< gbox src="/posts/img/2021/my-review/habits-cold-shower.png" title="Cold shower" caption="Heat map 2021" pos="left"  >}}

After reading more about [The Wim Hof Method](https://www.wimhofmethod.com/) I was determined enough to take cold showers
on a regular basis. I'm pretty happy I managed to stick to this habit throughout the year.
