org/blog.org
**** Breath work
{{< gbox src="/posts/img/2021/my-review/habits-pranayama.png" title="Breath work" caption="Heat map 2021" pos="left"  >}}

This is the type of morning exercise that boosts up my energy level after waking up. I
usually do /alternative nostril breathing/ (Yoga), break work after Wim Hof (I would say
80-90% of the time I do 3 rounds of 50 inhale/exhale rounds) and most recently also [[https://www.somabreath.com/][SOMA breath]].
**** Reading
{{< gbox src="/posts/img/2021/my-review/habits-reading.png" title="Reading" caption="Heat map 2021" pos="left"  >}}

I'm not happy with this one since I know I could have read more. It's just that I use to
have multiple /projects/ running in parallel so I need to apply some time-slicing to my
available time. What also keeps me busy from reading /more/ is the fact that always do some
/post-reading/ after each book: I collect notes/thoughts, I re-read interesting
pages/concepts, put everything into my [[https://brainfck.org][Zettelkasten]]. I'm already looking for a better
reading workflow. Maybe you have some ideas.
**** Sports/Workout
{{< gbox src="/posts/img/2021/my-review/habits-sport.png" title="Sports/Workout" caption="Heat map 2021" pos="left"  >}}

Yes, this is the most embarrassing one. I was somehow motivate to do more /sports/ beginning
with April but after June that kind of faded out. Next year I definitely want to do more
workout, at least once a week. I also want to combine my bodyweight training
(calisthenics) with climbing.

*** Tools
**** Emacs
I started going down the "Emacs rabbit hole" almost 2 years ago. And I still don't regret
doing so, although I've spent hours of debugging, trial and error, random copy&paste of
Elisp code. Also switching from [[https://www.spacemacs.org/][Spacemacs]] to [[https://github.com/hlissner/doom-emacs][Doom Emacs]] had a huge boost regarding my
productivity in Emacs. Now I can say I do understand most of my configuration (see my
[[https://github.com/dorneanu/dotfiles][dotfiles]]) whereas one year ago I was randomly copy&paste and putting pieces together in
the hope they'll somehow work.

{{< tweet user="victordorneanu" id="1222158980627288064" >}}

***** Modules
My top modules for this year:
- [[https://github.com/alphapapa/pocket-reader.el][pocket-reader.el]]
  - I use it every day as my favourite [[https://getpocket.com][getpocket]] client and as a collection inbox for everything I want to read, to share or to [[https://brainfck.org][bookmark]].
- [[https://github.com/skeeto/elfeed][elfeed]]
  - my RSS/Atom feeds aggregator which helps me to stay focused and read everything at one place
    - I like RSS (and you can still use RSS for everything)
    - Email/Newsletter subscription kind of destroyed the Internet :)
  - if I like the excerpt and can sent the URL to getpocket
- [[https://magit.vc/][magit]]
  - still a *magic* tool to deal with git
  - I also couldn't imagine conflict resolution can be that easy in a terminal
- [[https://www.djcbsoftware.nl/code/mu/mu4e.html][mu4e]]
  - yeah, finally I can read my mails in the terminal
    - have a look at my [[https://github.com/dorneanu/dotfiles/blob/main/dot_mbsyncrc.tmpl][configuration]]
- [[https://github.com/john2x/dank-mode][dank mode]]
  - this relatively unknown/new *reddit* client is like a hidden gem
  - you can read comments/posts as threads
  - I also like the Emacs like key bindings
- [[https://github.com/marcinkoziej/org-pomodoro][org-pomodoro]]
  - I use it daily
  - See below for more background
**** Configuration management
I use to keep my configuration files in a [[https://github.com/dorneanu/dotfiles][dotfiles]] repository, publicly available. This
year I had to keep custom configurations for 4-5 machines in different contextes (work,
private). So I needed to find a way how to manage configuration files and apply
customizations depending on the machine where that specific config was needed.

Initially I came across [[https://github.com/anishathalye/dotbot][dotbot]] which is written in Python and uses a YAML/JSON
configuration file in order to setup your dotfiles. But then I've found [[https://www.chezmoi.io/][chezmoi.]]
***** [[https://www.chezmoi.io/][chezmoi]]
This little {{{zk(Golang,Golang)}}} utility will manage your dotfiles across multiple machines in a secure manner. Among the top features:
- You will have a single source of truth
  - in one git repository you'll define your basic configuration
  - for each machine you can write [[https://pkg.go.dev/text/template][templates]] where you can change the behaviour depending on the operating system, architecture etc.
- secret management is outsourced
  - chezmoi can retrieve secrets from "1Password, Bitwarden, gopass, KeePassXC, LastPass, pass, Vault, Keychain, Keyring, or any command-line utility of your choice"
- it's fast
- declarative
  - you define the desired state of files, directories, symlinks in the git repository (source of truth) and chezmoi will update your ~$HOME~ directory to match that state
***** [[https://www.passwordstore.org/][pass]]
Password management is not easy, especially when you want to stay away from commercial
solutions. I wish I knew ~pass~ before I bought LastPass premium. Here are the reasons why I
like this little tool:
- it follows the /Unix/ philosophy
  - your passwords are stored in a simple file/folder structure
  - per file you'll have one secret
- each file gets /encrypted/ using ~gpg~
  - I like this approach since I can also use my [[https://www.yubico.com/][Yubikey(s)]] to do the encryption/decryption (BTW: This [[https://github.com/drduh/YubiKey-Guide][Yubikey guide]] is excellent if you want to setup your device for GPG and SSH authentication)
- you have version control
  - you can track password changes using ~git~
  - you can share your passwords between multiple machines
- you have [[https://www.passwordstore.org/#extensions][extensions]]
- although ~pass~ is a CLI there are also [[https://www.passwordstore.org/#other][GUIs]] for other platforms
  - for Android there is [[https://github.com/android-password-store/Android-Password-Store][Android Password Store]]
  - [[https://github.com/browserpass/browserpass-extension][BrowserPass]] for Chromium or Firefox
- you might also give [[https://github.com/gopasspw/gopass][gopass]], the "/slightly/ more awesome standard unix password manager for teams" a try
**** Productivity
***** Pomodorro
If you have troubles keeping yourself /focussed/ and tend to do /multi-tasking/, then I
recommend you should use a /pomodorro/ timer. At least since my son got born, I don't have
that much time available as I used to have some years ago. Becoming a parent indeed
changed the way I define [[https://www.scotthyoung.com/blog/2021/07/05/dad-productivity/][productivity]]. I can not concentrate on one task during a large
period of time because I always get "distracted". I need to do some grocery shopping, I
need to pick up my son from the kindergarten, I need to to some household... you name it.
So I had to find a way how to work on several projects/tasks (in a private but also work
context) but in /small/ chunks of work.

After using this technique for years now, I'm pretty sure it is one of my personal most
efficient productivity tools. Just use a (clock) timer, an application on your smartphone
or [[https://pomofocus.io/][pomofocus.io]] to get you started. Do rounds of 25-30 minutes (one pomodorro) and do a
larger break after 4 rounds. Believe me, you'll notice the difference.

