content/posts/2021-my-2021-review.md


### Breath work {#breath-work}

{{< gbox src="/posts/img/2021/my-review/habits-pranayama.png" title="Breath work" caption="Heat map 2021" pos="left"  >}}

This is the type of morning exercise that boosts up my energy level after waking up. I
usually do _alternative nostril breathing_ (Yoga), break work after Wim Hof (I would say
80-90% of the time I do 3 rounds of 50 inhale/exhale rounds) and most recently also [SOMA breath](https://www.somabreath.com/).


### Reading {#reading}

{{< gbox src="/posts/img/2021/my-review/habits-reading.png" title="Reading" caption="Heat map 2021" pos="left"  >}}

I'm not happy with this one since I know I could have read more. It's just that I use to
have multiple _projects_ running in parallel so I need to apply some time-slicing to my
available time. What also keeps me busy from reading _more_ is the fact that always do some
_post-reading_ after each book: I collect notes/thoughts, I re-read interesting
pages/concepts, put everything into my [Zettelkasten](https://brainfck.org). I'm already looking for a better
reading workflow. Maybe you have some ideas.


### Sports/Workout {#sports-workout}

{{< gbox src="/posts/img/2021/my-review/habits-sport.png" title="Sports/Workout" caption="Heat map 2021" pos="left"  >}}

Yes, this is the most embarrassing one. I was somehow motivate to do more _sports_ beginning
with April but after June that kind of faded out. Next year I definitely want to do more
workout, at least once a week. I also want to combine my bodyweight training
(calisthenics) with climbing.


## Tools {#tools}


### Emacs {#emacs}

I started going down the "Emacs rabbit hole" almost 2 years ago. And I still don't regret
doing so, although I've spent hours of debugging, trial and error, random copy&paste of
Elisp code. Also switching from [Spacemacs](https://www.spacemacs.org/) to [Doom Emacs](https://github.com/hlissner/doom-emacs) had a huge boost regarding my
productivity in Emacs. Now I can say I do understand most of my configuration (see my
[dotfiles](https://github.com/dorneanu/dotfiles)) whereas one year ago I was randomly copy&paste and putting pieces together in
the hope they'll somehow work.

{{< tweet user="victordorneanu" id="1222158980627288064" >}}


#### Modules {#modules}

My top modules for this year:

-   [pocket-reader.el](https://github.com/alphapapa/pocket-reader.el)
    -   I use it every day as my favourite [getpocket](https://getpocket.com) client and as a collection inbox for everything I want to read, to share or to [bookmark](https://brainfck.org).
-   [elfeed](https://github.com/skeeto/elfeed)
    -   my RSS/Atom feeds aggregator which helps me to stay focused and read everything at one place
        -   I like RSS (and you can still use RSS for everything)
        -   Email/Newsletter subscription kind of destroyed the Internet :)
    -   if I like the excerpt and can sent the URL to getpocket
-   [magit](https://magit.vc/)
    -   still a **magic** tool to deal with git
    -   I also couldn't imagine conflict resolution can be that easy in a terminal
-   [mu4e](https://www.djcbsoftware.nl/code/mu/mu4e.html)
    -   yeah, finally I can read my mails in the terminal
        -   have a look at my [configuration](https://github.com/dorneanu/dotfiles/blob/main/dot%5Fmbsyncrc.tmpl)
-   [dank mode](https://github.com/john2x/dank-mode)
    -   this relatively unknown/new **reddit** client is like a hidden gem
    -   you can read comments/posts as threads
    -   I also like the Emacs like key bindings
-   [org-pomodoro](https://github.com/marcinkoziej/org-pomodoro)
    -   I use it daily
    -   See below for more background


### Configuration management {#configuration-management}

I use to keep my configuration files in a [dotfiles](https://github.com/dorneanu/dotfiles) repository, publicly available. This
year I had to keep custom configurations for 4-5 machines in different contextes (work,
private). So I needed to find a way how to manage configuration files and apply
customizations depending on the machine where that specific config was needed.

Initially I came across [dotbot](https://github.com/anishathalye/dotbot) which is written in Python and uses a YAML/JSON
configuration file in order to setup your dotfiles. But then I've found [chezmoi.](https://www.chezmoi.io/)


#### [chezmoi](https://www.chezmoi.io/) {#chezmoi}

This little [Golang](https://brainfck.org/#Golang) utility will manage your dotfiles across multiple machines in a secure manner. Among the top features:

-   You will have a single source of truth
    -   in one git repository you'll define your basic configuration
    -   for each machine you can write [templates](https://pkg.go.dev/text/template) where you can change the behaviour depending on the operating system, architecture etc.
-   secret management is outsourced
    -   chezmoi can retrieve secrets from "1Password, Bitwarden, gopass, KeePassXC, LastPass, pass, Vault, Keychain, Keyring, or any command-line utility of your choice"
-   it's fast
-   declarative
    -   you define the desired state of files, directories, symlinks in the git repository (source of truth) and chezmoi will update your `$HOME` directory to match that state


#### [pass](https://www.passwordstore.org/) {#pass}

Password management is not easy, especially when you want to stay away from commercial
solutions. I wish I knew `pass` before I bought LastPass premium. Here are the reasons why I
like this little tool:

-   it follows the _Unix_ philosophy
    -   your passwords are stored in a simple file/folder structure
    -   per file you'll have one secret
-   each file gets _encrypted_ using `gpg`
    -   I like this approach since I can also use my [Yubikey(s)](https://www.yubico.com/) to do the encryption/decryption (BTW: This [Yubikey guide](https://github.com/drduh/YubiKey-Guide) is excellent if you want to setup your device for GPG and SSH authentication)
-   you have version control
    -   you can track password changes using `git`
    -   you can share your passwords between multiple machines
-   you have [extensions](https://www.passwordstore.org/#extensions)
-   although `pass` is a CLI there are also [GUIs](https://www.passwordstore.org/#other) for other platforms
    -   for Android there is [Android Password Store](https://github.com/android-password-store/Android-Password-Store)
    -   [BrowserPass](https://github.com/browserpass/browserpass-extension) for Chromium or Firefox
-   you might also give [gopass](https://github.com/gopasspw/gopass), the "_slightly_ more awesome standard unix password manager for teams" a try


### Productivity {#productivity}


#### Pomodorro {#pomodorro}

If you have troubles keeping yourself _focussed_ and tend to do _multi-tasking_, then I
recommend you should use a _pomodorro_ timer. At least since my son got born, I don't have
that much time available as I used to have some years ago. Becoming a parent indeed
changed the way I define [productivity](https://www.scotthyoung.com/blog/2021/07/05/dad-productivity/). I can not concentrate on one task during a large
period of time because I always get "distracted". I need to do some grocery shopping, I
need to pick up my son from the kindergarten, I need to to some household... you name it.
So I had to find a way how to work on several projects/tasks (in a private but also work
context) but in _small_ chunks of work.

After using this technique for years now, I'm pretty sure it is one of my personal most
efficient productivity tools. Just use a (clock) timer, an application on your smartphone
or [pomofocus.io](https://pomofocus.io/) to get you started. Do rounds of 25-30 minutes (one pomodorro) and do a
larger break after 4 rounds. Believe me, you'll notice the difference.
