org/blog.org
***** [[https://wakatime.com][Wakatime]]
By now you should know I'm obsessed with /time tracking/ and being productive in multiple
contextes. But sometimes I forget to start my pomodorro timer and at the end of the day I
don't know how much time I've spent working on a specific task. You can all this with
Emacs and [[https://github.com/marcinkoziej/org-pomodoro][org-pomodoro]] but for those of you non-Emacsers there is [[https://wakatime.com/][wakatime.com]]. They have
[[https://wakatime.com/plugins][plugins]] for almost everything: Shells, IDEs, Excel, Powerpoint etc.

If you have data privacy concerns, you might want to /hidden/ project and file names (also
check out my [[https://github.com/dorneanu/dots/blob/main/dot_wakatime.cfg.tmpl][wakatime configuration file]]).

***** [[https://play.google.com/store/apps/details?id=org.isoron.uhabits&hl=en&gl=US][Loop Habit Tracker]]
Sticking to healthy habits is important. {{{zk(Atomic Habits/Habit Tracking,Tracking)}}}
your progress will remind you to /act/. You have your progress in front of you and that will
eventually /motivate/ you. You don't feel motivated enough? Then you might apply the [[https://jamesclear.com/paper-clips][paper
clips strategy]]. Whatever you do: Track your progress and be honest to yourself. Don't push
yourself to hard, just treat yourself well and stick to your habit.
*** Outlook
For the upcoming year I'd like to
- learn
  - [[https://www.typescriptlang.org/][TypeScript]]
    - I've already started a course on [[https://www.udemy.com/course/understanding-typescript/][Udemy]] and I hope to finish it soon. The initial motivation was [[https://docs.aws.amazon.com/cdk/latest/guide/work-with-cdk-typescript.html][AWS CDK]] but meanwhile I think it's a great /static typed/ language.
    - I'm still not a JavaScript fan but I hope TypeScript will allow me to teach myself some /frontend/ basics.
  - [[https://vuejs.org/][Vue.JS]]
    - I want to be able to build /modern/ frontend applications and use new technologies beyond HTML, CSS and JavaScript :)
    - I heard it's quite beginner friendly
    - [[https://v3.vuejs.org/guide/typescript-support.html][v3]] supports TypeScript
  - [[https://en.wikipedia.org/wiki/Web3][Web3]]
    - I want to learn how blockchains work and especially focus on [[https://ethereum.org/en/][Ethereum]]
    - Not only for my current job I'd like to know which /Security/ threats exist beyond wallet theft
- read
  - [[https://www.goodreads.com/book/show/22512931-building-microservices][Building Microservices: Designing Fine-Grained Systems]]
  - [[https://leanpub.com/visualising-software-architecture][Visualise, document and explore your software architecture]]
  - [[https://abseil.io/resources/swe-book][Software Engineering at Google]]
  - [[https://dataintensive.net/][Designing Data-Intensive Applications]]
  - [[https://www.goodreads.com/book/show/28602719-domain-driven-design-distilled][Domain-Driven Design Distilled]]
  - [[https://github.com/ethereumbook/ethereumbook][Mastering Ethereum]]
- finish [[https://github.com/dorneanu/access-key-rotator][access-key-rotator]] and release first version
- clean up my [[https://brainfck.org][Zettelkasten]]
- start working on my *book*
  - about Golang and Security :)
That's it for now. Please share your favourite tools/productivity tipps as well as random comments/thoughts.

