content/posts/2021-my-2021-review.md


#### [Wakatime](https://wakatime.com) {#wakatime}

By now you should know I'm obsessed with _time tracking_ and being productive in multiple
contextes. But sometimes I forget to start my pomodorro timer and at the end of the day I
don't know how much time I've spent working on a specific task. You can all this with
Emacs and [org-pomodoro](https://github.com/marcinkoziej/org-pomodoro) but for those of you non-Emacsers there is [wakatime.com](https://wakatime.com/). They have
[plugins](https://wakatime.com/plugins) for almost everything: Shells, IDEs, Excel, Powerpoint etc.

If you have data privacy concerns, you might want to _hidden_ project and file names (also
check out my [wakatime configuration file](https://github.com/dorneanu/dots/blob/main/dot%5Fwakatime.cfg.tmpl)).


#### [Loop Habit Tracker](https://play.google.com/store/apps/details?id=org.isoron.uhabits&hl=en&gl=US) {#loop-habit-tracker}

Sticking to healthy habits is important. [Tracking](https://brainfck.org/#Atomic%20Habits/Habit%20Tracking)
your progress will remind you to _act_. You have your progress in front of you and that will
eventually _motivate_ you. You don't feel motivated enough? Then you might apply the [paper
clips strategy](https://jamesclear.com/paper-clips). Whatever you do: Track your progress and be honest to yourself. Don't push
yourself to hard, just treat yourself well and stick to your habit.


## Outlook {#outlook}

For the upcoming year I'd like to

-   learn
    -   [TypeScript](https://www.typescriptlang.org/)
        -   I've already started a course on [Udemy](https://www.udemy.com/course/understanding-typescript/) and I hope to finish it soon. The initial motivation was [AWS CDK](https://docs.aws.amazon.com/cdk/latest/guide/work-with-cdk-typescript.html) but meanwhile I think it's a great _static typed_ language.
        -   I'm still not a JavaScript fan but I hope TypeScript will allow me to teach myself some _frontend_ basics.
    -   [Vue.JS](https://vuejs.org/)
        -   I want to be able to build _modern_ frontend applications and use new technologies beyond HTML, CSS and JavaScript :)
        -   I heard it's quite beginner friendly
        -   [v3](https://v3.vuejs.org/guide/typescript-support.html) supports TypeScript
    -   [Web3](https://en.wikipedia.org/wiki/Web3)
        -   I want to learn how blockchains work and especially focus on [Ethereum](https://ethereum.org/en/)
        -   Not only for my current job I'd like to know which _Security_ threats exist beyond wallet theft
-   read
    -   [Building Microservices: Designing Fine-Grained Systems](https://www.goodreads.com/book/show/22512931-building-microservices)
    -   [Visualise, document and explore your software architecture](https://leanpub.com/visualising-software-architecture)
    -   [Software Engineering at Google](https://abseil.io/resources/swe-book)
    -   [Designing Data-Intensive Applications](https://dataintensive.net/)
    -   [Domain-Driven Design Distilled](https://www.goodreads.com/book/show/28602719-domain-driven-design-distilled)
    -   [Mastering Ethereum](https://github.com/ethereumbook/ethereumbook)
-   finish [access-key-rotator](https://github.com/dorneanu/access-key-rotator) and release first version
-   clean up my [Zettelkasten](https://brainfck.org)
-   start working on my **book**
    -   about Golang and Security :)

That's it for now. Please share your favourite tools/productivity tipps as well as random comments/thoughts.
